# vi: ft=ruby

# TODO look into https://github.com/buo/homebrew-cask-upgrade

tap "github/gh"
tap "nodenv/nodenv"
tap "jacobwgillespie/tap"
# tap "universal-ctags/universal-ctags"

brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "bats-core"
brew "brew-gem"
brew "bundler-completion"
brew "coreutils"
# brew "csvkit"
brew "curl"
# brew "docker-compose-completion"
brew "dos2unix"
brew "findutils"
# brew "fish"
brew "node"
brew "fx"
brew "fzf"
# brew "gel"
brew "gem-completion"
# brew "gem-foreman"
# brew "gem-github_changelog_generator"
brew "ruby"
# brew "gem-md2man"
# brew "gem-reek"
brew "gh"
# brew "ghi"
brew "gist"
brew "git"
brew "git-crypt"
brew "git-hooks-go"
brew "git-imerge"
brew "git-lfs"
brew "jacobwgillespie/tap/git-sync"
brew "gnu-sed"
brew "gnu-tar"
brew "gnutls"
brew "gnupg"
# brew "gpg-agent"
# brew "help2man"
# brew "heroku/brew/heroku"
brew "highlight"
# brew "hub"
# brew "icdiff"
# brew "unar"
# brew "jid"
brew "jq"
brew "launchctl-completion"
brew "libpq"
brew "lynx"
brew "mas"
brew "nodenv"
# brew "nss"
brew "open-completion"
brew "openssh"
brew "tmux"
brew "overmind"
# brew "pidof"
# brew "pinentry-mac" # gpg-suite cask instead
brew "rails-completion"
brew "rake-completion"
# brew "rakudo-star"
brew "ruby-build"
brew "rbenv", args: ["HEAD"]
# brew "rbenv-bundler-ruby-version"
# brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ruby-completion"
brew "selecta"
# brew "serve"
# brew "serveit"
brew "shellcheck"
brew "ssh-copy-id"
brew "tealdeer"
brew "the_silver_searcher"
brew "tig"
brew "tree"
# brew "vagrant-completion"
brew "vim"
brew "watch"
brew "wget"
brew "xdg-ninja"
brew "yarn-completion"
brew "ykman"
# brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]


cask "1password"
cask "1password-cli"
cask "alfred"
# cask "betterzipql"
cask "choosy"
cask "docker-desktop"
# cask "figma"
cask "firefox"
cask "font-fira-code"
cask "font-monaspace"
# cask "gitter"
# cask "google-chrome"
cask "gpg-suite-no-mail"
# cask "grandperspective"
cask "keybase"
# cask "launchrocket"
cask "licecap"
# cask "macvim", args: ["force"] # conflicts with vim
# cask "miro"
# cask "muzzle"
# cask "ngrok"
cask "notion"
# cask "opera"
# cask "paw"
cask "postman"
# cask "qlcolorcode"
# cask "qlimagesize"
# cask "qlmarkdown"
# cask "qlprettypatch"
# cask "qlstephen"
# cask "quicklook-json"
# cask "sequel-pro"
cask "slack"
# cask "suspicious-package"
cask "tableplus"
# cask "time-out"
# cask "tunnelblick"
# cask "viscosity"
# cask "webpquicklook"
cask "yubico-authenticator"
cask "zoom"

mas "1Password for Safari", id: 1569813296
mas "Ka-Block!", id: 1335413823
mas "Moom", id: 419330170
mas "Shush - Microphone Manager", id: 496437906
