tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "nodenv/nodenv"

brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "bats-core"
brew "brew-gem"
brew "bundler-completion"
brew "coreutils"
brew "csvkit"
brew "curl"
brew "docker-compose-completion"
brew "dos2unix"
brew "exa"
brew "findutils"
brew "fish"
brew "node"
brew "fx"
brew "fzf"
brew "gel"
brew "gem-completion"
brew "gem-foreman"
brew "gem-github_changelog_generator"
brew "ruby"
brew "gem-md2man"
brew "gem-reek"
brew "gem-travis"
brew "ghi"
brew "gist"
brew "git"
brew "git-crypt"
brew "git-hooks", args: ["HEAD"]
brew "git-imerge"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-tar"
brew "gnutls"
brew "gnupg"
brew "gpg-agent"
brew "help2man"
brew "heroku/brew/heroku"
brew "highlight"
brew "hub"
brew "icdiff"
brew "unar"
brew "ievms"
brew "jid"
brew "jq"
brew "launchctl-completion"
brew "lynx"
brew "mas"
brew "mdcat"
# brew "mysql@5.7", restart_service: true, link: true
# brew "nginx", restart_service: true
brew "nodenv"
brew "nss"
brew "open-completion"
brew "openssh"
brew "tmux"
brew "overmind"
brew "pidof"
# brew "postgresql", restart_service: true
# brew "protobuf"
brew "rails-completion"
brew "rake-completion"
# brew "rakudo-star"
brew "ruby-build"
brew "rbenv", args: ["HEAD"]
# brew "rbenv-bundler-ruby-version"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "ripgrep"
brew "ruby-completion"
brew "selecta"
brew "serveit"
brew "shellcheck", args: ["HEAD"]
brew "ssh-copy-id"
brew "tealdeer"
brew "the_silver_searcher"
brew "tig"
brew "tmate"
brew "tree"
brew "vagrant-completion"
brew "vim"
brew "watch"
brew "wget"
brew "yarn-completion"
brew "ykman"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]


cask "1password"
cask "1password-cli"
cask "alfred"
cask "authy"
cask "betterzipql"
cask "colloquy"
cask "docker"
cask "dropbox"
cask "encryptme"
cask "firefox"
cask "font-fira-code"
cask "gitter"
# cask "gitx"
cask "google-chrome"
cask "google-drive"
cask "gpg-suite"
cask "grandperspective"
cask "keybase"
# cask "laullon-gitx"
cask "launchrocket"
cask "licecap"
cask "macvim"
cask "muzzle"
cask "ngrok"
cask "opera"
cask "paw"
# cask "pgadmin4"
# cask "picasa"
cask "postman"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-json"
# cask "rowanj-gitx"
cask "sequel-pro"
cask "skype"
cask "suspicious-package"
cask "teamviewer"
# cask "time-out"
cask "trailer"
# cask "tunnelblick"
cask "viscosity"
cask "webpquicklook"
cask "zoomus"

# vi: ft=ruby
